export const dataMachines = [
  {
    type: 'tokarnye-stanki',
    modifications: [
      {
        name: '16А20Ф3',
        description:
          'Токарный станок предназначен для обработки в полуавтоматическом режиме наружных и внутренних поверхностей деталей типа тел вращения со ступенчатым и криволинейным профилем, различной сложности.',
        structure: {
          title: 'Токарный станок 16А20Ф3 с ЧПУ NC-210',
          description: [
            [
              'На станке установлена современная система ЧПУ NC-210 (ООО «Балт-Систем», г.Санкт-Петербург).',
            ],
            [
              'В электро шкафу устанавливается новая электро автоматика и новые привода подач и главного движения BSD (ООО "Балт Систем").',
            ],
            ['Установлена новая револьверная головка УГ9326- 06'],
          ],
        },
        equipping: {
          title:
            'Токарные станки с ЧПУ типа 16А20Ф3 могут быть поставлены по желанию заказчика с различными приводами и системами ЧПУ в следующей комплектации:',
          description: [
            ['транспортером для удаления стружки или без него;'],
            ['с электромеханическим или ручным патроном для зажима заготовки.'],
          ],
        },
        specifications: {
          title: 'Техническиe характеристики:',
          description: [
            ['Максимальный обрабатываемый диаметр над станиной мм 500'],
            ['Максимальный обрабатываемый диаметр над суппортом мм 200'],
            ['Максимальная длина обработки мм 1000'],
            ['Мощность электропривода подачи шпинделя кВт 11'],
            ['Частота вращения шпинделя об/ мин 20-2500'],
            [
              'Габаритные размеры станка (длина, ширина, высота) мм 3700/2260/1650',
            ],
            ['Вес станка кг 4000'],
          ],
        },
        price: {
          title: 'Цена и гарантия:',
          description: [
            ['Продавец дает гарантию 12 месяцев.'],
            ['Стоимость станка 16А20Ф3 – 3 800 000 рублей.'],
          ],
        },
        warranty: {
          title: 'Гарантия:',
          description: [['Продавец дает гарантию 12 месяцев.']],
        },
        photos: ['16a20f3_1.jpg'],
      },
      {
        name: '16М30Ф3',
        description: 'Токарно-винторезный станок модели 16М30Ф3 с ЧПУ NC-210 .',
        structure: {
          title: 'Краткие сведения о станке:',
          description: [
            [
              'На станке установлена современная система ЧПУ NC-210 (ООО «Балт-Систем», г.Санкт-Петербург).',
            ],
            [
              'В новом электро шкафу устанавливается новая электро автоматика , новые комплектные привода подач ВSD и главного движения  Дельта .',
            ],
            ['Новые ШВП .'],
            [
              'Четырех позиционная инструментальная головка с горизонтальным расположением .',
            ],
            ['Электрогидравлический привод пиноли задней бабки.'],
          ],
        },
        specifications: {
          title: 'Техническиe характеристики:',
          description: [
            ['Модель 16М30Ф3'],
            ['Наибольший диаметр заготовки устанавливаемой над станиной  670'],
            ['Максимальный обрабатываемый диаметр над станиной мм 500'],
            ['Максимальный обрабатываемый диаметр над суппортом мм 320'],
            ['Максимальная длина обработки мм 1500'],
            [
              'Габаритные размеры станка (длина, ширина, высота) мм 3700/2260/1650',
            ],
            ['Частота вращения шпинделя об/ мин 8-2000'],
            [
              'Габаритные размеры станка (длина, ширина,высота) мм 5290/4255/2130',
            ],
            ['Вес станка кг 8000'],
          ],
        },
        price: {
          title: 'Цена',
          description: [['Стоимость станка 16М30Ф3:    4 800 000 рублей.']],
        },
        warranty: {
          title: 'Гарантия:',
          description: [
            [
              'на станок 16М30Ф3 – 12 месяцев с момента сдачи станка Покупателю;',
            ],
            [
              'на систему ЧПУ NC-210 – 24 месяца (предоставляяет производитель ООО «Балт-Систем», г.Санкт-Петербург).',
            ],
          ],
        },
        photos: [
          '16m30f3_3.jpeg',
          '16m30f3_2.jpeg',
          '16m30f3_1.jpeg',
          '16m30f3_5.jpeg',
        ],
      },
      {
        name: '16К30Ф3',
        description:
          'Токарно-винторезный станок модели 16К30Ф3 с системой ЧПУ NC-210.',
        structure: {
          title: 'Краткие сведения о станке:',
          description: [
            [
              'На станке установлена современная система ЧПУ NC-210 (ООО «Балт-Систем», г.Санкт-Петербург).',
            ],
            [
              'В новом электро шкафу устанавливаеться новая электро автоматика и новые привода подач ВSD и главного движения Дельта .',
            ],
            ['Четырех позиционная инструментальная головка.'],
            ['Электрогидравлический привод пиноли задней бабки.'],
          ],
        },
        job_description: {
          title: 'Краткое описание работ на станке:',
          sub_title_1:
            'В процессе реновации по механической части производиться',
          description_1: [
            ['Очистка и отмывка всех узлов станка.'],
            ['Замена подшипников, сальников и изношенных деталей.'],
            ['Общие работы по восстановлению свойств и ресурса станка.'],
            ['Сборка и отладка узлов в сборе.'],
          ],
          sub_title_2: 'На станке 16К30Ф3 по электро части проводиться:',
          description_2: [
            ['Написание алгоритма работы станка.'],
            ['Настройка и включение приводов.'],
            ['Сборка по станку в целом.'],
          ],
        },
        specifications: {
          title: 'Техническиe характеристики:',
          description: [
            ['Наибольший диаметр заготовки устанавливаемой над станиной  630'],
            ['Максимальный обрабатываемый диаметр над станиной мм  500'],
            ['Максимальный обрабатываемый диаметр над суппортом мм   320'],
            ['Максимальная длина обработки мм  1400'],
            ['Мощность электропривода подачи шпинделя кВт 30'],
            ['Частота вращения шпинделя об/ мин 8-2000'],
            [
              'Габаритные размеры станка (длина, ширина,высота) мм 5290/4255/2130',
            ],
            ['Вес станка кг 8000'],
          ],
        },
        documentation: {
          title: 'В комплект документации входит:',
          description: [
            [
              'Паспорт станка, руководство по эксплуатации (механическую и гидравлическая часть станка).',
            ],
            ['Новый пакет документов на схему принципиальную электрическую.'],
            ['Резервная копия программ.'],
            ['Наличие технической документации.'],
          ],
        },
        price: {
          title: 'Цена:',
          description: ['Стоимость станка 16К30Ф3: 4 500 000 рублей.'],
        },
        warranty: {
          title: 'Гарантия:',
          description: [
            ['На станок – 12 месяцев с момента сдачи станка Покупателю;'],
            [
              'На систему ЧПУ NC-210 – 24 месяца (предоставляяет производитель ООО «Балт-Систем», г.Санкт-Петербург).',
            ],
          ],
        },
        photos: ['16K30f3', '16K30f3_1', '16K30f3_2'],
      },
    ],
  },
  {
    type: 'press',
    modifications: [
      {
        name: 'ПД–630',
        description:
          'Вальцы резиносмесительные подогревающие ПД – 630 315/315 предназначены для повышения пластичности и подогреварезиновых смесей, каучука и пластмасс, смешения каучука и пластмасс с различными ингредиентами, а также для листования смесей.',
        basic_information: [
          [
            'Вальцы ПД-630 315/315 состоят из станины, валков, привода, механизма раздвижки валков, узла подвода теплоносителя и системы смазки.',
          ],
          [
            'Вальцы установлены на виброизолирующие опоры и не требуют крепления к фундаменту.',
          ],
          [
            'Резиновая смесь обрабатывается в межвалковом зазоре, регулируемом перемещением переднего валка.',
          ],
          [
            'Предусмотрено регулирование температуры поверхности валков, осуществляемое подачей воды и пара.',
          ],
          [
            'Безопасная работа на вальцах обеспечена одним верхним и двумя нижними аварийными устройствами.',
          ],
        ],
        specification: [
          ['Диаметр рабочей части валков, мм', '315'],
          ['Длина рабочей части валков, мм', '630'],
          ['Длина рабочей части между стрелами, мм', '540'],
          ['Поверхность валков', 'Гладкая'],
          ['Скорость валков, переднего, м/мин', '15.8 (16)'],
          ['Скорость валков, заднего, м/мин', '19.8 (20)'],
          ['Фрикция', '1:1,25 (1:4)'],
          [
            'Допускаемое распрочное усилие на 1 см рабочей части валков, Н (кгс)',
            '11000 (1100)',
          ],
          ['Зазор между валками, регулируемый, мм', '0.5...10'],
          ['Температура валков, °C', '25-80... (150)'],
          ['Обогрев валков', 'вода... (пар)'],
          ['Охлаждение валков', 'вода'],
          ['Установленная мощность, кВт: привода валков', '30'],
          ['Габаритные размеры, мм: длина', '2400'],
          ['Габаритные размеры, мм: ширина', '1450'],
          ['Габаритные размеры, мм: высота', '1700'],
          ['Масса, кг', '5000'],
          ['Соответствует ГОСТ', '14333'],
        ],
        price: 'Стоимость: 900 000 рублей, в т.ч. НДС 18%.',
        warranty: {
          title: 'Срок поставки – в наличии на складе.',
        },
        photos: ['pd-630'],
      },
      {
        name: 'Модель B',
        description: 'Описание модели B.',
      },
    ],
  },
  {
    type: 'pruzhinonavivochnye-stanki',
    modifications: [
      {
        name: 'Модель X',
        description: 'Описание модели X.',
      },
      {
        name: 'Модель Y',
        description: 'Описание модели Y.',
      },
    ],
  },
  {
    type: 'listopravilnye-mashiny',
    modifications: [
      {
        name: 'Модель L',
        description: 'Описание модели L.',
      },
      {
        name: 'Модель M',
        description: 'Описание модели M.',
      },
    ],
  },
  {
    type: 'Спецпредложения',
    modifications: [
      {
        name: 'Модель S1',
        description: 'Описание модели S1.',
      },
      {
        name: 'Модель S2',
        description: 'Описание модели S2.',
      },
    ],
  },
];
